# ==============================================================================
# ユーザー操作用キーワード定数 (key_words テーブルに格納される値)
# ==============================================================================

# ユーザー情報登録/変更を開始
USER_KEYWORD_REGISTER = '登録'

# 商品の注文を開始
USER_KEYWORD_ORDER = '注文'

# 注文状態の確認を開始
USER_KEYWORD_STATUS = '確認'

# 注文キャンセルを開始
USER_KEYWORD_CANCEL = 'キャンセル'


# ==============================================================================
# 管理者操作用キーワード定数 (管理者チャットからのトリガー)
# ==============================================================================

# 日別・商品別の注文状況レポート
ADMIN_KEYWORD_DAILY_PRODUCT_REPORT = 'テクマクマヤコン'

# 日別・ユーザー別の注文状況レポート
ADMIN_KEYWORD_DAILY_USER_REPORT = 'ゆりぴょんチェック'

# 当日のユーザー別注文状況レポート
ADMIN_KEYWORD_TODAY_USER_REPORT = '今日'

# 休日設定
ADMIN_KEYWORD_HOLIDAYS = '休み'

# 現行の標準消費税率 (10%を小数で表現)
TAX_RATE = 0.00

# トークンの有効期限（単位: 秒）。5分 = 300秒
TOKEN_EXPIRATION_SECONDS = 300

# constants.pyに追加

# ==============================================================================
# LINE イベント関連の定数
# ==============================================================================
LINE_MESSAGE_TEXT = 'text'
LINE_EVENT_MESSAGE = 'message'


# ==============================================================================
# データベース スケジュール関連の定数
# ==============================================================================
SCHEDULE_TYPE_DAILY = 'DAILY'
SCHEDULE_TYPE_WEEKLY = 'WEEKLY'

SCHEDULE_MON = 'MON'
SCHEDULE_TUE = 'TUE'
SCHEDULE_WED = 'WED'
SCHEDULE_THU = 'THU'
SCHEDULE_FRI = 'FRI'



# LINE イベント関連の定数
LINE_MESSAGE_TEXT = 'text'
LINE_EVENT_MESSAGE = 'message'